app/controllers/books_controller.rb

    def update
        @book = Book.find(params[:id])

        if @book.update(book_params)
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "books" SET "title" = ?, "author" = ?, "genre" = ?, "price" = ?, "published_date" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "Test"], ["author", "Test"], ["genre", "Test"], ["price", 12.21], ["published_date", "Jan12, 2020"], ["updated_at", "2020-09-14 04:41:45.516022"], ["id", 1]]

    def create
        @book = Book.new(params.require(:books).permit(:title,:author,:genre,:price,:published_date))

        if @book.save
---
INSERT INTO "books" ("title", "author", "genre", "price", "published_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)